{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "ConnectionStrings": {
    "DefaultConnection": "Data Source=../Database/GroupProjectDevelopment.db;Cache=Shared"
  },
  "AuthOptions": {
    "Issuer": "GroupProject-Issuer",
    "Audience": "GroupProject-Audience"
  },
  "ConfigurationOptions": {
    "rules": "Forum members are not allowed\n1. Leave messages on the forums containing:\ninformation constituting a state or other secret specially protected by law;\nextremist materials;\nmaterials containing:\n- public calls for terrorist activity or publicly justifying terrorism;\n- propaganda of pornography, the cult of violence and cruelty;\n- profanity, offensive, nationalistic, rude, obscene and any other information that violates generally accepted moral and ethical norms;\n- information on methods, methods of development, manufacture and use, places of purchase of narcotic drugs, psychotropic substances and their precursors, new potentially dangerous psychoactive substances, promotion of any advantages of using certain means, methods and places of cultivation of narcotic plants;\n- information containing instructions for homemade production of explosives and explosive devices;\ninformation on means of committing suicide, as well as calls to commit suicide.\n2. To post messages that provoke conflict with other forum participants.\n3. Use prohibited nicknames. Pseudonyms containing website addresses, names of organizations, names of state authorities and local self-government bodies, e-mail addresses, mats, insults, obscene words, their derivatives or allusions to them are not allowed. As a nickname, you cannot use the names of famous writers, politicians, actors, scientists and other famous people, if it is not your own name. The use of an identical nickname or a parody of the nickname of an already registered user is not allowed.\n4. Excessive use of capital letters (Caps Lock mode).\n5. To use as an avatar an image containing advertising, the logo of the organization and other related advertising materials, as well as bloody scenes, scenes of violence or pornography, suicides, the production and use of narcotics and other substances and means withdrawn from circulation, scenes of committing other illegal acts and crimes.",
    "warningCountForBan": 3,
    "banDuration": "30.00:00:00",
    "verificationDuration": "30.00:00:00",
    "verificationRequiredPhrases": [
      "Ve",
      "VerifyWord",
      "LooooooooooooooooooongVerifyWord"
    ],
    "forbiddenPhrases": [
      "Sh",
      "BadWord",
      "LoooooooooooooooooooooongBadWord"
    ]
  }
}
